zephyrproject-rtos/zephyr/boards/nxp/mimxrt700_evk/board.c
#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(lcdif), nxp_mipi_dbi_dcnano_lcdif, okay)
	/* Assert LCDIF reset. */
	RESET_SetPeripheralReset(kLCDIF_RST_SHIFT_RSTn);

	/* Disable media main and LCDIF power down. */
	POWER_DisablePD(kPDRUNCFG_SHUT_MEDIA_MAINCLK);
	POWER_DisablePD(kPDRUNCFG_APD_LCDIF);
	POWER_DisablePD(kPDRUNCFG_PPD_LCDIF);

	/* Apply power down configuration. */
	POWER_ApplyPD();

	/* Calculate the divider for MEDIA MAIN clock source main pll pfd2. */
	CLOCK_InitMainPfd(kCLOCK_Pfd2, (uint64_t)CLOCK_GetMainPllFreq() * 18UL /
						DT_PROP(DT_NODELABEL(lcdif), clock_frequency));
	CLOCK_SetClkDiv(kCLOCK_DivMediaMainClk, 1U);
	CLOCK_AttachClk(kMAIN_PLL_PFD2_to_MEDIA_MAIN);
#endif

#if (DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(i3c2)) || \
		DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(i3c3)))
	CLOCK_AttachClk(kSENSE_BASE_to_I3C23);
	CLOCK_SetClkDiv(kCLOCK_DivI3c23Clk, 4U);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(pmc_tmpsns))
	POWER_DisablePD(kPDRUNCFG_PD_PMC_TEMPSNS);
	POWER_ApplyPD();
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(co5300_zc143ac72mipi), okay)
	POWER_DisablePD(kPDRUNCFG_SHUT_MEDIA_MAINCLK);
	POWER_DisablePD(kPDRUNCFG_APD_LCDIF);
	POWER_DisablePD(kPDRUNCFG_PPD_LCDIF);
	POWER_ApplyPD();


	CLOCK_InitMainPfd(kCLOCK_Pfd2, 17);
	CLOCK_SetClkDiv(kCLOCK_DivMediaMainClk, 2U);
	CLOCK_AttachClk(kMAIN_PLL_PFD2_to_MEDIA_MAIN);
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(xspi0))
	POWER_DisablePD(kPDRUNCFG_APD_XSPI0);
	POWER_DisablePD(kPDRUNCFG_PPD_XSPI0);
	POWER_ApplyPD();
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(xspi1))
	xspi_setup_clock(XSPI1, 1U, 1U); /* Audio PLL PDF1 DIV1. */

	POWER_DisablePD(kPDRUNCFG_APD_XSPI1);
	POWER_DisablePD(kPDRUNCFG_PPD_XSPI1);
	POWER_ApplyPD();
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(xspi2))
#if CONFIG_SOC_MIMXRT798S_CM33_CPU0
	CLOCK_AttachClk(kMAIN_PLL_PFD3_to_XSPI2);
#elif CONFIG_SOC_MIMXRT798S_CM33_CPU1
	CLOCK_AttachClk(kFRO1_DIV1_to_COMMON_BASE);
	CLOCK_AttachClk(kCOMMON_BASE_to_XSPI2);
#endif
	CLOCK_SetClkDiv(kCLOCK_DivXspi2Clk, 1U);

	POWER_DisablePD(kPDRUNCFG_APD_XSPI2);
	POWER_DisablePD(kPDRUNCFG_PPD_XSPI2);
	POWER_ApplyPD();
#endif
#ifdef CONFIG_NXP_NEUTRON
	POWER_DisablePD(kPDRUNCFG_APD_NPU);
	POWER_DisablePD(kPDRUNCFG_PPD_NPU);
	POWER_ApplyPD();
#endif

#if DT_HAS_COMPAT_STATUS_OKAY(nxp_jpegdec)
	CLOCK_EnableClock(kCLOCK_JpgDecoder);
	RESET_ClearPeripheralReset(kJPEGDEC_RST_SHIFT_RSTn);

	POWER_DisablePD(kPDRUNCFG_PPD_JPEGDEC);
	POWER_DisablePD(kPDRUNCFG_APD_JPEGDEC);
	POWER_ApplyPD();
#endif

#if DT_HAS_COMPAT_STATUS_OKAY(nxp_pngdec)
	CLOCK_EnableClock(kCLOCK_PngDecoder);
	RESET_ClearPeripheralReset(kPNGDEC_RST_SHIFT_RSTn);

	POWER_DisablePD(kPDRUNCFG_APD_PNGDEC);
	POWER_DisablePD(kPDRUNCFG_PPD_PNGDEC);
	POWER_ApplyPD();
#endif
}

static void GlikeyWriteEnable(GLIKEY_Type *base, uint8_t idx)
{
	(void)GLIKEY_SyncReset(base);

	(void)GLIKEY_StartEnable(base, idx);
	(void)GLIKEY_ContinueEnable(base, GLIKEY_CODEWORD_STEP1);
	(void)GLIKEY_ContinueEnable(base, GLIKEY_CODEWORD_STEP2);
	(void)GLIKEY_ContinueEnable(base, GLIKEY_CODEWORD_STEP3);
	(void)GLIKEY_ContinueEnable(base, GLIKEY_CODEWORD_STEP_EN);
}

static void GlikeyClearConfig(GLIKEY_Type *base)
{
	(void)GLIKEY_SyncReset(base);
}

/* Disable the secure check for AHBSC and enable periperhals/sram access for masters */
static void BOARD_InitAHBSC(void)
{
#if defined(CONFIG_SOC_MIMXRT798S_CM33_CPU0)
	GlikeyWriteEnable(GLIKEY0, 1U);
	AHBSC0->MISC_CTRL_DP_REG = 0x000086aa;
	/* AHBSC0 MISC_CTRL_REG, disable Privilege & Secure checking. */
	AHBSC0->MISC_CTRL_REG = 0x000086aa;

	GlikeyWriteEnable(GLIKEY0, 7U);
	/* Enable arbiter0 accessing SRAM */
	AHBSC0->COMPUTE_ARB0RAM_ACCESS_ENABLE = 0x3FFFFFFF;
	AHBSC0->SENSE_ARB0RAM_ACCESS_ENABLE = 0x3FFFFFFF;
	AHBSC0->MEDIA_ARB0RAM_ACCESS_ENABLE = 0x3FFFFFFF;
	AHBSC0->NPU_ARB0RAM_ACCESS_ENABLE = 0x3FFFFFFF;
	AHBSC0->HIFI4_ARB0RAM_ACCESS_ENABLE = 0x3FFFFFFF;
#endif

	GlikeyWriteEnable(GLIKEY1, 1U);
	AHBSC3->MISC_CTRL_DP_REG = 0x000086aa;
	/* AHBSC3 MISC_CTRL_REG, disable Privilege & Secure checking.*/
	AHBSC3->MISC_CTRL_REG = 0x000086aa;

	GlikeyWriteEnable(GLIKEY1, 9U);
	/* Enable arbiter1 accessing SRAM */
	AHBSC3->COMPUTE_ARB1RAM_ACCESS_ENABLE = 0x3FFFFFFF;
	AHBSC3->SENSE_ARB1RAM_ACCESS_ENABLE = 0x3FFFFFFF;
	AHBSC3->MEDIA_ARB1RAM_ACCESS_ENABLE = 0x3FFFFFFF;
	AHBSC3->NPU_ARB1RAM_ACCESS_ENABLE = 0x3FFFFFFF;
	AHBSC3->HIFI4_ARB1RAM_ACCESS_ENABLE = 0x3FFFFFFF;
	AHBSC3->HIFI1_ARB1RAM_ACCESS_ENABLE = 0x3FFFFFFF;

	GlikeyWriteEnable(GLIKEY1, 8U);
	/* Access enable for COMPUTE domain masters to common APB peripherals.*/
	AHBSC3->COMPUTE_APB_PERIPHERAL_ACCESS_ENABLE = 0xffffffff;
	AHBSC3->SENSE_APB_PERIPHERAL_ACCESS_ENABLE = 0xffffffff;
	GlikeyWriteEnable(GLIKEY1, 7U);
	AHBSC3->COMPUTE_AIPS_PERIPHERAL_ACCESS_ENABLE = 0xffffffff;
	AHBSC3->SENSE_AIPS_PERIPHERAL_ACCESS_ENABLE = 0xffffffff;

	GlikeyWriteEnable(GLIKEY2, 1U);
	/*Disable secure and secure privilege checking. */
	AHBSC4->MISC_CTRL_DP_REG = 0x000086aa;
	AHBSC4->MISC_CTRL_REG = 0x000086aa;

#if defined(CONFIG_SOC_MIMXRT798S_CM33_CPU0)
	GlikeyClearConfig(GLIKEY0);
#endif
	GlikeyClearConfig(GLIKEY1);
	GlikeyClearConfig(GLIKEY2);
}

#if CONFIG_DT_HAS_NXP_MCUX_EDMA_ENABLED
static void edma_enable_all_request(uint8_t instance)
{
	uint32_t *reg;

	for (uint8_t idx = 0; idx < EN_NUM; idx++) {
		reg = EDMA_EN_REG(instance, idx);
		*reg |= 0xFFFFFFFF;
	}
}
#endif

#if defined(CONFIG_SECOND_CORE_MCUX) && defined(CONFIG_SOC_MIMXRT798S_CM33_CPU0)
/**
 * @brief Kickoff secondary core (CPU1).
 *
 * Kick the secondary core out of reset and wait for it to indicate boot. The
 * core image was already copied to RAM in soc_early_init_hook()
 */
static void second_core_boot(void)
{
	/* Get the boot address for the second core */
	uint32_t boot_address = (uint32_t)(DT_REG_ADDR(DT_CHOSEN(zephyr_code_cpu1_partition)));

	/*
	 * Power up the SRAM partitions CPU1 needs before releasing it: the RAM it
	 * boots from and the RAM it links against. Both come from CPU0's chosen
	 * nodes rather than node labels, so the mask follows whatever memory CPU1
	 * is pointed at instead of hard-coding this board's current choice, and it
	 * replaces a hand-maintained constant.
	 *
	 * These are votes on CPU1's behalf, needed only because CPU1 cannot cast its
	 * own before it runs. They are handed back below.
	 */
	uint32_t cpu1_sram_pu =
		POWER_SRAM_MASK_FOR_NODE(DT_CHOSEN(zephyr_code_cpu1_partition)) |
		POWER_SRAM_MASK_FOR_NODE(DT_CHOSEN(zephyr_sram_cpu1_partition));

	PMC0->PDRUNCFG2 &= ~cpu1_sram_pu;
	PMC0->PDRUNCFG3 &= ~cpu1_sram_pu;

	/* Power up sense_main_clk, the bus clock of CPU1 and its private peripherals */
	POWER_DisablePD(kPDRUNCFG_SHUT_SENSEP_MAINCLK);
	POWER_ApplyPD();

