zephyrproject-rtos/zephyr/boards/nxp/mimxrt700_evk/board.c
	/*
	 * CPU1 clocks XSPI2 from COMMON_BASE, which the branch above points at
	 * FRO1_DIV1. FRO1 has no field in SLEEPCON1, so CPU1 cannot hold it up over
	 * a CPU0 low-power window and CPU0 has no way to detect the dependency:
	 * COMNBASECLKSEL says what feeds COMMON_BASE, not who consumes it, and the
	 * Sense-side selects are in CLKCTL1, which this build cannot address. Say it
	 * here, where both cores' clock trees are set up.
	 */
	power_cross_domain_request(PWR_RES_FRO1);

	/* RT700 specific CPU1 boot sequence */
	/* Glikey write enable, GLIKEY4 */
	GlikeyWriteEnable(GLIKEY4, 1U);

	/* Boot source for Core 1 from RAM. */
	SYSCON3->CPU1_NSVTOR = ((uint32_t)(void *)boot_address >> 7U);
	SYSCON3->CPU1_SVTOR = ((uint32_t)(void *)boot_address >> 7U);

	GlikeyClearConfig(GLIKEY4);

	/* Enable cpu1 clock. */
	CLOCK_EnableClock(kCLOCK_Cpu1);

	/* Clear reset*/
	RESET_ClearPeripheralReset(kCPU1_RST_SHIFT_RSTn);

	/* Release cpu wait*/
	SYSCON3->CPU_STATUS &= ~SYSCON3_CPU_STATUS_CPU_WAIT_MASK;

	/* Wait CPU1 booted */
	RESET_ClearPeripheralReset(kMU1_RST_SHIFT_RSTn);
	MU_Init(MU1_MUA);

	while (MU_GetFlags(MU1_MUA) != IMXRT7XX_CPU1_BOOT_FLAG) {
	}

	/*
	 * CPU1 is up, so hand the proxy votes back. CPU1's board_early_init_hook()
	 * runs before its PRE_KERNEL_2 boot flag goes out, so by the time the wait
	 * above returns CPU1 has claimed all of this in PMC1/SLEEPCON1 itself.
	 *
	 * Keeping them would leave CPU0's run bank voting keep for resources CPU0 does
	 * not use, and a keep vote from either core wins the aggregation (RM 27.3.2.2).
	 * That costs nothing today -- CPU1 is running and voting the same way -- but it
	 * would override CPU1's own decision the moment CPU1 gains a low-power state of
	 * its own, which is exactly the case RM 12.5.2 Table 167 forbids. The bits CPU1
	 * is holding up stay up; only CPU0's redundant vote goes away.
	 */
	PMC0->PDRUNCFG2 |= cpu1_sram_pu & ~POWER_SRAM_KEEPALIVE;
	PMC0->PDRUNCFG3 |= cpu1_sram_pu & ~POWER_SRAM_KEEPALIVE;
	POWER_EnablePD(kPDRUNCFG_SHUT_SENSEP_MAINCLK);
	POWER_ApplyPD();
}

void board_late_init_hook(void)
{
	second_core_boot();
}
#endif

#if defined(CONFIG_SECOND_CORE_MCUX) && defined(CONFIG_SOC_MIMXRT798S_CM33_CPU1)
static int second_core_notify_boot(void)
{
	RESET_ClearPeripheralReset(kMU1_RST_SHIFT_RSTn);
	MU_Init(MU1_MUB);
	MU_SetFlags(MU1_MUB, IMXRT7XX_CPU1_BOOT_FLAG);

	return 0;
}

SYS_INIT(second_core_notify_boot, PRE_KERNEL_2, CONFIG_KERNEL_INIT_PRIORITY_DEFAULT);
#endif

#if defined(CONFIG_LV_USE_DRAW_VG_LITE) || defined(CONFIG_VGLITE)
static int gpu_init_imxrt7xx(const struct device *dev)
{
	ARG_UNUSED(dev);

	POWER_DisablePD(kPDRUNCFG_APD_GPU);
	POWER_DisablePD(kPDRUNCFG_PPD_GPU);
	POWER_ApplyPD();

	/* VGPU clock enablement and divider selection */
	CLOCK_EnableClock(kCLOCK_MediaAccessRamArbiter0);
	CLOCK_EnableClock(kCLOCK_MediaAccessRamArbiter1);
	CLOCK_EnableClock(kCLOCK_Gpu);

	CLOCK_AttachClk(kFRO0_DIV1_to_VGPU);
	CLOCK_SetClkDiv(kCLOCK_DivVgpuClk, 1U);

	/* Enable GPU interrupt */
	RESET_ClearPeripheralReset(kVGPU_RST_SHIFT_RSTn);
	NVIC_SetPriority(VGPU_IRQn, CONFIG_VG_LITE_INTERRUPT_PRIORITY);
	EnableIRQ((IRQn_Type)VGPU_IRQn);

	return 0;
}

DEVICE_DT_DEFINE(DT_INST(0, nxp_gpu), gpu_init_imxrt7xx, NULL,
		NULL, NULL, POST_KERNEL,
		CONFIG_KERNEL_INIT_PRIORITY_DEFAULT, NULL);

void gpu_cache_flush_range(void *addr, size_t size)
{
	sys_cache_data_flush_range(addr, size);
}
#endif /* CONFIG_LV_USE_DRAW_VG_LITE || CONFIG_VGLITE */
